import React from 'react';
import {TableDay} from "./component/TableComponents/TableDay/TableDay";
import {Days, Student, Weeks} from "./features/student";

let students = [
    new Student(1, "Акперов Эмиль Бахтиярович",
        [new Days(new Date(2024, 3, 4), [{
            pairName: "Математика",
            hours: 1
        }, {
            pairName: "БЖД",
            hours: 1
        }, {
            pairName: "Экономика",
            hours: 2
        }, {
            pairName: "Сети",
            hours: 0
        }]), new Days(new Date(2024, 3, 5), [{
            pairName: "Математика",
            hours: 0
        }, {
            pairName: "БЖД",
            hours: 2
        }, {
            pairName: "Экономика",
            hours: 2
        }, {
            pairName: "Сети",
            hours: 0
        }])],
        [new Weeks(new Date(2024, 3, 4), 0, 0)]),
    new Student(2, "Исупов Григорий Сергеевич",
        [new Days(new Date(2024, 3, 4), [{
            pairName: "Математика",
            hours: 0
        }, {
            pairName: "БЖД",
            hours: 2
        }, {
            pairName: "Экономика",
            hours: 2
        }, {
            pairName: "Сети",
            hours: 0
        }])],
        [new Weeks(new Date(2024, 3, 4), 0, 0)])
]

let store = {
    students: students,
    days: [{
        date: new Date(2024, 3, 4),
        pairs: ["Математика", "БЖД", "Экономика", "Сети"]
    }]
}

// let students = [
//     "Акперов Эмиль Бахтиярович",
//     "Амелин Кирилл Сергеевич",
//     "Амирова Зарина Азатовна",
//     "Воеводин Егор Олегович",
//     "Гаврилюк Александр Валерьевич",
//     "Гарипова Эллина Ильгизовна",
//     "Гончаровский Максим Николаевич",
//     "Гришин Семён Евгеньевич",
//     "Иванова Ксения Анатольевна",
//     "Исупов Григорий Сергеевич",
//     "Князев Артём Павлович",
//     "Коновалов Егор Александрович",
//     "Максимов Иван Дмитриевич",
//     "Макуров Михаил Павлович",
//     "Нейман Алексей Дмитриевич",
//     "Николайчук Алёна Сергеевна",
//     "Оркин Родион Родионович",
//     "Останина Татьяна Олеговна",
//     "Позоян Рафаэль Овакимович",
//     "Решетняк Степан Алексеевич",
//     "Рид Екатерина Романовна",
//     "Ромадова Ирина Олеговна",
//     "Хандусь Максим Васильевич",
//     "Хапков Михаил Евгеньевич",
//     "Чвиков Матвей Евгеньевич",
//     "Шумкарбеков Илим Мадиярович",
//     "Юлдашева Эмилия Дамировна",
//     "Ямщиков Артём Владиславович"
// ]
let currentDay = new Date(2024, 3, 4);
;

const App = () => {
    return (
        <TableDay now={currentDay} store={store}/>
    );
}

export default App;